export const AllData = 
{
    buttons : ["الكل" , "فطار" , "غداء" , "عشاء" , "سناكس"],
    items :[
        {
            id : Math.random() ,
            title: "وجبة فطار" ,
            description : "فطور شهي ومغذي يعتبر بداية يوم مثالية. يتكون من تشكيلة متنوعة من الأطعمة اللذيذة والمفيدة. يمكن أن يشمل الفطور العديد من العناصر الغذائية مثل الخبز والحبوب والفواكه واللبن والبيض واللحوم والخضروات." ,
            price : "50 جنيه" , 
            category : "فطار" , 
            imgUrl : "https://imagess.net/wp-content/uploads/2017/04/302-2.jpg"
        },
        {
            id : Math.random() ,
            title: "وجبة غداء" ,
            description : "وجبة غداء لذيذة ومغذية تساعدك على إعادة شحن طاقتك في منتصف اليوم. يمكن أن تشمل وجبة الغداء السلطة المليئة بالخضروات، والبروتين مثل الدجاج المشوي، والأرز أو البطاطس، والخبز. استمتع بوجبة الغداء للتجديد واستعدادك لبقية يومك." ,
            price : "70 جنيه" , 
            category : "غداء" , 
            imgUrl : "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ-OKbv7QtV4etXQTiuHaVgMvJp0eo2Vuwy33uoZkq0KjEDtSk-14K7Lc1ZHQUCPEmquB0&usqp=CAU"
        },
        {
            id : Math.random() ,
            title: "وجبة عشاء" ,
            description : "تناول وجبة العشاء اللذيذة والمتوازنة لإنهاء يومك بشكل ممتع ومشبع. يمكن أن تشمل وجبة العشاء اللحم المشوي أو السمك، والخضروات المشوية أو المطهوة، والكاربوهيدرات مثل الأرز أو الباستا. استمتع بوجبة العشاء واسترخِ واستعد للنوم." ,
            price : "100 جنيه" , 
            category : "عشاء" , 
            imgUrl : "https://static.malekah.info/1204200524405708746-683464661.jpg"
        },
        {
            id : Math.random() ,
            title: "سناكس" ,
            description : "تناول وجبة سناكس خفيفة ولذيذة في وقت الاستراحة. يمكن أن تشمل وجبة السناكس الفواكه المقطعة، والمكسرات، والزبادي، والعصائر الطبيعية. استمتع بوجبة السناكس لتعزيز طاقتك ومزاجك خلال اليوم." , 
            price : "40 جنيه" , 
            category : "سناكس" , 
            imgUrl : "https://img-global.cpcdn.com/recipes/5e014284cc4b2ff6/680x482cq70/%D8%A7%D9%84%D8%B5%D9%88%D8%B1%D8%A9-%D8%A7%D9%84%D8%B1%D8%A6%D9%8A%D8%B3%D9%8A%D8%A9-%D9%84%D9%88%D8%B5%D9%81%D8%A9%D8%B3%D9%86%D8%A7%D9%83%D8%B3-%D8%A7%D9%84%D8%A8%D8%B7%D8%A7%D8%B7%D8%B3-%D9%85%D9%82%D8%B1%D9%85%D8%B4%D8%A9-%D9%88-%D9%87%D8%A7%D8%B4%D8%A9.jpg"
        },
        {
            id : Math.random() ,
            title: "وجبة فطار مميزة" ,
            description : "فطور صباحي شهي يتضمن تناول تشكيلة من الأطعمة الصحية والمغذية. يمكن أن يتضمن الفطور البيض المسلوق، والخبز المحمص مع الزبدة والمربى، والفاكهة الطازجة، والحليب أو الزبادي. استمتع بوجبة الفطور لبدء يومك بنشاط وحيوية." , 
            price : "60 جنيه" , 
            category : "فطار" , 
            imgUrl : "https://static.webteb.net/images/content/slideshowslide_sss_8959_822e6c698dc-7172-4ae1-8b72-d14fa69d8e0a.jpg"
        },
        {
            id : Math.random() ,
            title: "وجبة غداء مميزة" ,
            description : "تناول وجبة غداء شهية ومشبعة لتجديد طاقتك في منتصف اليوم. يمكن أن تتضمن وجبة الغداء الدجاج المشوي مع الخضروات المشكلة، والأرز المنسوج، وسلطة الطماطم والخيار. استمتع بوجبة الغداء واستعد لاستكمال نشاطك." , 
            price : "80 جنيه" , 
            category : "غداء" , 
            imgUrl : "https://m.3bir.net/files/0877500424.jpg"
        },
        {
            id : Math.random() ,
            title: "وجبة عشاء مميزة" ,
            description : "استمتع بوجبة عشاء شهية ومرضية لإنهاء يومك بأفضل طريقة ممكنة. يمكن أن تشتمل وجبة العشاء على سلطة البحر المتوسط مع الروبيان والمحار والكالاماري، مع رفقة خبز الثوم المحمص. استمتع بوجبة العشاء واسترخِ بعد يوم طويل." , 
            price : "110 جنيه" , 
            category : "عشاء" , 
            imgUrl : "https://blog.elcoach.me/articles/wp-content/uploads/2022/02/%D9%88%D8%AC%D8%A8%D8%A7%D8%AA-%D8%B9%D8%B4%D8%A7%D8%A1-%D8%B5%D8%AD%D9%8A%D8%A9.jpg"
        }
    ]
}